In [24]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("AcademicPerformance.csv")
print(df)

      gender race/ethnicity parental level of education         lunch  \
0     female        group B           bachelor's degree      standard
1     female        group C                some college      standard
2     female        group B             master's degree      standard
3       male        group A          associate's degree  free/reduced
4       male        group C                some college      standard
...      ...            ...                         ...           ...
2235     NaN            NaN                         NaN           NaN
2236     NaN            NaN                         NaN           NaN
2237     NaN            NaN                         NaN           NaN
2238     NaN            NaN                         NaN           NaN
2239     NaN            NaN                         NaN           NaN

     test preparation course  Year_Birth  math score reading score  \
0                       none      1970.0        72.0            72
1                  completed      1961.0         NaN            na
2                       none      1958.0        90.0            95
3                       none      1967.0         NaN           NaN
4                       none      1989.0        76.0            78
...                      ...         ...         ...           ...
2235                     NaN         NaN         NaN           NaN
2236                     NaN         NaN         NaN           NaN
2237                     NaN         NaN         NaN           NaN
2238                     NaN         NaN         NaN           NaN
2239                     NaN         NaN         NaN           NaN

     writing score Dt_Admission College_Fees
0               74      6/16/14  $84,835.00
1                A      6/15/14  $57,091.00
2               93      5/13/14  $67,267.00
3               44   05-11-2014  $32,474.00
4               75   04-08-2014  $21,474.00
...            ...          ...          ...
2235           NaN          NaN          NaN
2236           NaN          NaN          NaN
2237           NaN          NaN          NaN
2238           NaN          NaN          NaN
2239           NaN          NaN          NaN

[2240 rows x 11 columns]

In [4]:
print(df['math score'])

0       72.0
1        NaN
2       90.0
3        NaN
4       76.0
        ...
2235     NaN
2236     NaN
2237     NaN
2238     NaN
2239     NaN
Name: math score, Length: 2240, dtype: float64

In [8]:
print(df['math score'].isnull())

0       False
1        True
2       False
3        True
4       False
        ...
2235     True
2236     True
2237     True
2238     True
2239     True
Name: math score, Length: 2240, dtype: bool

In [10]:
print(df['reading score'])

0        72
1        na
2        95
3       NaN
4        78
       ...
2235    NaN
2236    NaN
2237    NaN
2238    NaN
2239    NaN
Name: reading score, Length: 2240, dtype: object

In [11]:
print(df['reading score'].isnull())

0       False
1       False
2       False
3        True
4       False
        ...
2235     True
2236     True
2237     True
2238     True
2239     True
Name: reading score, Length: 2240, dtype: bool

In [14]:
missing_value = ['na','--','n/a']
df = pd.read_csv("AcademicPerformance.csv",na_values = missing_value)
print(df)

      gender race/ethnicity parental level of education         lunch  \
0     female        group B           bachelor's degree      standard
1     female        group C                some college      standard
2     female        group B             master's degree      standard
3       male        group A          associate's degree  free/reduced
4       male        group C                some college      standard
...      ...            ...                         ...           ...
2235     NaN            NaN                         NaN           NaN
2236     NaN            NaN                         NaN           NaN
2237     NaN            NaN                         NaN           NaN
2238     NaN            NaN                         NaN           NaN
2239     NaN            NaN                         NaN           NaN

     test preparation course  Year_Birth  math score  reading score  \
0                       none      1970.0        72.0           72.0
1                  completed      1961.0         NaN            NaN
2                       none      1958.0        90.0           95.0
3                       none      1967.0         NaN            NaN
4                       none      1989.0        76.0           78.0
...                      ...         ...         ...            ...
2235                     NaN         NaN         NaN            NaN
2236                     NaN         NaN         NaN            NaN
2237                     NaN         NaN         NaN            NaN
2238                     NaN         NaN         NaN            NaN
2239                     NaN         NaN         NaN            NaN

     writing score Dt_Admission College_Fees
0               74      6/16/14  $84,835.00
1                A      6/15/14  $57,091.00
2               93      5/13/14  $67,267.00
3               44   05-11-2014  $32,474.00
4               75   04-08-2014  $21,474.00
...            ...          ...          ...
2235           NaN          NaN          NaN
2236           NaN          NaN          NaN
2237           NaN          NaN          NaN
2238           NaN          NaN          NaN
2239           NaN          NaN          NaN

[2240 rows x 11 columns]

In [16]:
print(df["Dt_Admission"])

0          6/16/14
1          6/15/14
2          5/13/14
3       05-11-2014
4       04-08-2014
           ...
2235           NaN
2236           NaN
2237           NaN
2238           NaN
2239           NaN
Name: Dt_Admission, Length: 2240, dtype: object

In [22]:
df["Dt_Admission"] = pd.to_datetime(df["Dt_Admission"], errors="coerce")
print(df["Dt_Admission"])

0      2014-06-16
1      2014-06-15
2      2014-05-13
3      2014-05-11
4      2014-04-08
          ...
2235          NaT
2236          NaT
2237          NaT
2238          NaT
2239          NaT
Name: Dt_Admission, Length: 2240, dtype: datetime64[ns]

In [27]:
dataset = [20,45,68,78,95,10,16]
sorted(dataset)

[10, 16, 20, 45, 68, 78, 95]

In [29]:
quantile1,quantile3 =  np.percentile(dataset,[25,75])
print(quantile1,quantile3)

18.0 73.0

In [31]:
ipr_values = (quantile3 - quantile1)
print(ipr_values)

55.0

In [33]:
lower_bound = quantile1 - (1.5*ipr_values)
upper_bound = quantile3 + (1.5*ipr_values)
print(lower_bound,upper_bound)

-64.5 155.5

In [37]:
from datetime import date
df['age'] = date.today().year - df['Year_Birth']
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Year_Birth,math score,reading score,writing score,Dt_Admission,College_Fees,age
0,female,group B,bachelor's degree,standard,none,1970.0,72.0,72.0,74,2014-06-16,"$84,835.00",53.0
1,female,group C,some college,standard,completed,1961.0,NaN,NaN,A,2014-06-15,"$57,091.00",62.0
2,female,group B,master's degree,standard,none,1958.0,90.0,95.0,93,2014-05-13,"$67,267.00",65.0
3,male,group A,associate's degree,free/reduced,none,1967.0,NaN,NaN,44,2014-05-11,"$32,474.00",56.0
4,male,group C,some college,standard,none,1989.0,76.0,78.0,75,2014-04-08,"$21,474.00",34.0

In [39]:
df['Year'] = pd.DatetimeIndex(df['Dt_Admission']).year
df['E_L'] = date.today().year - df['Year']
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,Year_Birth,math score,reading score,writing score,Dt_Admission,College_Fees,age,Year,E_L,Fees$,Fees_M$
0,female,group B,bachelor's degree,standard,none,1970.0,72.0,72.0,74,2014-06-16,"$84,835.00",53.0,2014.0,9.0,8483500,8
1,female,group C,some college,standard,completed,1961.0,NaN,NaN,A,2014-06-15,"$57,091.00",62.0,2014.0,9.0,5709100,6
2,female,group B,master's degree,standard,none,1958.0,90.0,95.0,93,2014-05-13,"$67,267.00",65.0,2014.0,9.0,6726700,7
3,male,group A,associate's degree,free/reduced,none,1967.0,NaN,NaN,44,2014-05-11,"$32,474.00",56.0,2014.0,9.0,3247400,3
4,male,group C,some college,standard,none,1989.0,76.0,78.0,75,2014-04-08,"$21,474.00",34.0,2014.0,9.0,2147400,2